// See https://aka.ms/new-console-template for more information
Console.WriteLine("Hello, World!");

Решение в группах задач:
Задача 26: Напишите программу, которая принимает
на вход число и выдаёт количество цифр в числе.
456 -> 3
78 -> 2
89126 -> 5
